public/man/man1/flatpak-remote-delete.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-remote-delete.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-remote-delete.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-remote-delete - Delete a remote repository</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak remote-delete</strong> [OPTION…] NAME</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Removes a remote repository from the flatpak repository configuration.
NAME is the name of an existing remote.</p>
<p>
Unless overridden with the <strong>–system</strong>, <strong>–user</strong>, or <strong>–installation</strong>
options, this command uses either the default system-wide installation
or the per-user one, depending on which has the specified REMOTE.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>-u</strong>, <strong>–user</strong></p>
<blockquote>
<p>Modify the per-user configuration.</p>
</blockquote>
<p>
<strong>–system</strong></p>
<blockquote>
<p>Modify the default system-wide configuration.</p>
</blockquote>
<p>
<strong>–installation=NAME</strong></p>
<blockquote>
<p>Modify a system-wide installation specified by NAME among those defined
in <em>etc/flatpak/installations.d</em>. Using <strong>–installation=default</strong> is
equivalent to using <strong>–system</strong>.</p>
</blockquote>
<p>
<strong>–force</strong></p>
<blockquote>
<p>Remove remote even if its in use by installed apps or runtimes.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>$ flatpak –user remote-delete dried-raisins</strong></p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*flatpak*(1), *flatpak-remote-add*(1), *flatpak-remote-modify*(1),
*flatpak-remotes*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
